БухЭксп/Catalogs/CW_ОбъектыАрхива.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ОбъектыАрхива</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.CW_ВладельцыАрхива</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Comment>Имя файла без расширения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Том</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТомаАрхива</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлЗахвачен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийРедактор</Name>
					<Comment>Пользователь захвативший файл</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлЗагружен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыДокументовФайловогоАрхива</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеПараметров</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВОблаке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектАрхиваВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ОбъектыАрхива</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Редактор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособХраненияАрхива</Name>
					<Comment>0 - прикреплен,1 - в облаке; 2 - ссылка на ранее прикрепленный</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ОбъектыАрхива/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийПользователь=CW_Настройки.Пользователь();
	
	// установим объект  
	Если Параметры.Ключ.Пустая() Тогда
		ВладелецАрхива = CW_РаботаСФайламиСервер.ПолучитьВладельцаАрхиваПоОбъекту(Параметры.ЗначенияЗаполнения.Объект);
		
		Объект.Владелец = Параметры.ЗначенияЗаполнения.Объект;	
		Объект.Родитель = Параметры.ЗначенияЗаполнения.Родитель;
	КонецЕсли;
	
	ЭтоНовый = Объект.Ссылка.Пустая();
	
	Если Объект.Том.Пустая() Тогда
		
		// установим том
		
		УстановитьПривилегированныйРежим(Истина);
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ТомаАрхива.Ссылка
		|ИЗ
		|	Справочник.CW_ТомаАрхива КАК ТомаАрхива
		|ГДЕ
		|	ТомаАрхива.Основной = ИСТИНА";
		Запрос.УстановитьПараметр("", );
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			
			Объект.Том = Выборка.Ссылка;
			
		КонецЕсли; 
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли; 
	
	СформироватьПолноеИмяФайла();
	СформироватьРазмер();
	
	// --- 
	Если Объект.СпособХраненияАрхива = 1 Тогда
		Элементы.ПолноеИмя.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;	
	КонецЕсли;  
	
	УказанСтороннийВладелец = ЗначениеЗаполнено(Объект.ОбъектАрхиваВладелец);
	
	Элементы.ГруппаОблако.Видимость 		= (Объект.СпособХраненияАрхива = 1) И Не УказанСтороннийВладелец;
	Элементы.ГруппаХранение.Видимость 		= (Объект.СпособХраненияАрхива <> 1) И Не УказанСтороннийВладелец;
	Элементы.ФормаСохранитьКак.Видимость 	= (Объект.СпособХраненияАрхива <> 1) И Не УказанСтороннийВладелец;
	Элементы.ГруппаВладелецФайла.Видимость 	= УказанСтороннийВладелец;   
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	УказанСтороннийВладелец = ЗначениеЗаполнено(Объект.ОбъектАрхиваВладелец);
	Если Объект.СпособХраненияАрхива = 1 И Не УказанСтороннийВладелец Тогда 
		Если ПустаяСтрока(ПолноеИмя) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана ссылка на файл",,"ПолноеИмя",,Отказ); 
		Иначе
			ТекущийОбъект.ИмяФайла = ПолноеИмя;   
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	ЭтаФорма.Записать();
	
КонецПроцедуры

// --- 

&НаСервере
Процедура СформироватьПолноеИмяФайла()
	
	ПолноеИмя = Объект.ИмяФайла;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьРазмер()
	// --- 
	
	РазмерСтрокой = _сф.ф_ПриведенныйРазмер(Объект.Размер);
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаВОблакоНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ложь;
	
	#Если Вебклиент Тогда 
		ПерейтиПоНавигационнойСсылке(Объект.ИмяФайла);
	#Иначе
		ЗапуститьПриложение(Объект.ИмяФайла);
	#КонецЕсли
	
КонецПроцедуры



&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	ОповеститьОЗаписиНового(Объект.Ссылка);
	
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьФайлДляПросмотра()
	
	Если ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;    
	
	ДанныеФайла = CW_РаботаСФайламиКлиент.ДанныеФайла(ТекущаяСсылкаНаФайл(), УникальныйИдентификатор);	
	CW_РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла);
	
КонецПроцедуры  

&НаКлиенте
Процедура СохранитьКак()
	
	Если ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеФайла = CW_РаботаСФайламиКлиент.ДанныеФайла(ТекущаяСсылкаНаФайл(), УникальныйИдентификатор);	
	CW_РаботаСФайламиКлиент.СохранитьКак(ДанныеФайла);
	
КонецПроцедуры

&НаКлиенте
Функция ЭтоНовый()
	
	Возврат ТекущаяСсылкаНаФайл().Пустая();
	
КонецФункции

&НаКлиенте
Функция ТекущаяСсылкаНаФайл()
	
	ОбъектФормы = ЭтотОбъект.Объект; // СправочникОбъект
	Возврат ОбъектФормы.Ссылка;
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьФайл(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(, "Необходимо записать элемент!");
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПомещенияФайлаНаСервер", ЭтотОбъект, ДополнительныеПараметры); 
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.Заголовок  			= "Выберите файл";
	ПараметрыДиалога.Фильтр					= "(*.*)|*.*";
	ПараметрыДиалога.МножественныйВыбор	 	= Истина;  
	
	НачатьПомещениеФайлаНаСервер(ОписаниеОповещения,,,, ПараметрыДиалога, УникальныйИдентификатор);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеПомещенияФайлаНаСервер(ПомещенныйФайл, ДополнительныеПараметры) Экспорт 
	
	Если ПомещенныйФайл = Неопределено Тогда
		Возврат;
	КонецЕсли;      
	
	ОсновнойТомХранения = CW_РаботаСФайламиСервер.ПолучитьОсновнойТомХранения();
	
	Успешно = CW_РаботаСФайламиСервер.ЗаписатьФайлВТомХранения(Объект.Ссылка, ПомещенныйФайл.Адрес, ОсновнойТомХранения);
	
	Если Не Успешно Тогда
		ПоказатьПредупреждение(, "Не удалось добавить файл!", ,"Ошибка добавления файла");
	Иначе  
		
		Объект.ИмяФайла		= ПомещенныйФайл.СсылкаНаФайл.Имя;
		Объект.Наименование = ПомещенныйФайл.СсылкаНаФайл.Имя;	
		ПолноеИмя    		= ПомещенныйФайл.СсылкаНаФайл.Имя;
		
		Объект.Расширение   = ПомещенныйФайл.СсылкаНаФайл.Расширение;
		
		ОбъектАрхива = ПолучитьОбъектАрхива(Объект.Владелец);
		
		ОповеститьОбИзменении(ОбъектАрхива); 
		ОповеститьОбИзменении(Тип("СправочникСсылка.CW_ОбъектыАрхива")); 
	КонецЕсли;
	
КонецПроцедуры     

&НаСервереБезКонтекста
Функция ПолучитьОбъектАрхива(ВладелецАрхива)
	
	Возврат ВладелецАрхива.ОбъектАрхива;
	
КонецФункции
